In [ ]:
SQL Basic Assignment

1. Create a table called employees with the following structure?
 emp_id (integer, should not be NULL and should be a primary key)Q
 emp_name (text, should not be NULL)Q
 age (integer, should have a check constraint to ensure the age is at least 18)Q
 email (text, should be unique for each employee)Q
 salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints
Ans To create the employees table in a PostgreSQL (or similar SQL-compliant) database using Python, you can use the psycopg2 library (for PostgreSQL) or sqlite3 (for SQLite). Below is the SQL query to create the table with all the specified constraints:

In [ ]:
CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.
Ans Purpose of Constraints in a Database
Constraints in a database are rules applied to columns in a table to ensure data integrity, consistency, and accuracy. They prevent invalid data from being inserted and maintain relationships between different tables.

How Constraints Help Maintain Data Integrity
Prevent Invalid Data Entry – Ensures only valid data is stored in the database.
Enforce Business Rules – Constraints help enforce real-world business logic (e.g., age must be ≥ 18).
Ensure Uniqueness – Avoid duplicate records (e.g., emails should be unique).
Maintain Relationships – Ensure data consistency across multiple tables (e.g., foreign keys).
Improve Query Performance – Indexed constraints (like PRIMARY KEY) speed up searches.
Common Types of Constraints with Examples
Primary Key (PRIMARY KEY)

Ensures each row in a table has a unique identifier and cannot be NULL.
Example

In [ ]:
CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,  -- Unique ID for each employee
    emp_name TEXT NOT NULL
);

Not Null (NOT NULL)

Ensures a column cannot have NULL values.
Example

In [ ]:
CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    username TEXT NOT NULL  -- Username is required
);

Unique (UNIQUE)

Ensures no duplicate values in a column.
Example

In [ ]:
CREATE TABLE customers (
    customer_id SERIAL PRIMARY KEY,
    email TEXT UNIQUE  -- Each email must be unique
);

Foreign Key (FOREIGN KEY)

Ensures referential integrity by linking a column to another table’s PRIMARY KEY.
CREATE TABLE orders (
    order_id SERIAL PRIMARY KEY,
    customer_id INT REFERENCES customers(customer_id)  -- Must match an existing customer_id
);
Default (DEFAULT)

Assigns a default value if none is provided.
CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,
    salary DECIMAL DEFAULT 30000  -- Default salary is 30,000
);

3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer
Ans.Why Apply the NOT NULL Constraint to a Column?
The NOT NULL constraint ensures that a column must always have a value and cannot contain NULL. This is important for fields where missing values would cause inconsistencies or errors in the application logic.

Reasons for Using NOT NULL
Ensures Data Completeness – Prevents missing information in essential columns.
Maintains Data Integrity – Ensures that all records contain necessary data.
Improves Query Performance – Helps optimize indexing and searching.
Prevents Logical Errors – Avoids unexpected NULL values that could cause issues in calculations or conditions.
Example: Using NOT NULL in a Table
sql
Copy
Edit
CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    username TEXT NOT NULL,  -- Every user must have a username
    email TEXT UNIQUE NOT NULL  -- Email is mandatory and must be unique
);
Can a Primary Key Contain NULL Values?
No, a PRIMARY KEY cannot contain NULL values.

Justification:
Uniqueness Requirement – The PRIMARY KEY uniquely identifies each row in a table. A NULL value is not a unique identifier.
Indexing & Search Optimization – Databases create indexes on PRIMARY KEY columns to speed up queries, which would be inefficient with NULL values.
Logical Consistency – A row must have a unique identifier to be referenced in relationships (e.g., FOREIGN KEY constraints).
Example: Attempting to Insert NULL in a Primary Key
sql
Copy
Edit
CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,
    emp_name TEXT NOT NULL
);

INSERT INTO employees (emp_id, emp_name) VALUES (NULL, 'John Doe');  -- This will FAIL


sql
Copy
Edit
INSERT INTO employees (emp_name) VALUES ('John Doe');  -- emp_id auto-generates (if SERIAL is used)

4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.
Ans.Steps to Add or Remove Constraints on an Existing Table
In SQL, modifying constraints on an existing table requires the ALTER TABLE command. Depending on the database system (PostgreSQL, MySQL, SQLite, etc.), some constraints can be directly modified, while others may require workarounds.

Adding a Constraint
Syntax:

sql
Copy
Edit
ALTER TABLE table_name ADD CONSTRAINT constraint_name constraint_type (column);
Example: Adding a CHECK Constraint
Let's say we have an employees table, but it currently doesn't enforce an age restriction. We can add a CHECK constraint to ensure that employees must be at least 18 years old.

sql
Copy
Edit
ALTER TABLE employees
ADD CONSTRAINT chk_age CHECK (age >= 18);
Removing a Constraint
Syntax:

sql
Copy
Edit
ALTER TABLE table_name DROP CONSTRAINT constraint_name;
Note: Some constraints, like NOT NULL, cannot be dropped directly. Instead, you may need to alter the column.

Example: Removing a CHECK Constraint
If we decide to remove the age restriction:

sql
Copy
Edit
ALTER TABLE employees
DROP CONSTRAINT chk_age;
Example: Removing a NOT NULL Constraint
Since NOT NULL is part of the column definition, we modify the column instead:

sql
Copy
Edit
ALTER TABLE employees
ALTER COLUMN emp_name DROP NOT NULL;

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.
Ans.Consequences of Violating Constraints in SQL
When attempting to INSERT, UPDATE, or DELETE data in a way that violates constraints, the database system rejects the operation and returns an error message. This helps maintain data integrity and prevents inconsistent or incorrect data from being stored.

Types of Constraint Violations & Their Consequences
1 NOT NULL Constraint Violation
Consequence: Attempting to insert NULL into a column marked as NOT NULL will cause an error.
Example:
sql
Copy
Edit
CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,
    emp_name TEXT NOT NULL
);

INSERT INTO employees (emp_id, emp_name) VALUES (1, NULL);
Error Message:
sql
Copy
Edit
ERROR:  null value in column "emp_name" violates not-null constraint
2 PRIMARY KEY Constraint Violation
Consequence: A PRIMARY KEY must be unique and not NULL. If a duplicate value is inserted, an error occurs.
Example:
sql
Copy
Edit
INSERT INTO employees (emp_id, emp_name) VALUES (1, 'John Doe');
INSERT INTO employees (emp_id, emp_name) VALUES (1, 'Jane Smith'); -- Duplicate emp_id
Error Message:
sql
Copy
Edit
ERROR:  duplicate key value violates unique constraint "employees_pkey"
3 UNIQUE Constraint Violation
Consequence: Attempting to insert duplicate values in a column with a UNIQUE constraint will be rejected.
Example:
sql
Copy
Edit
CREATE TABLE customers (
    customer_id SERIAL PRIMARY KEY,
    email TEXT UNIQUE
);

INSERT INTO customers (email) VALUES ('user@example.com');
INSERT INTO customers (email) VALUES ('user@example.com'); -- Duplicate email
Error Message:
sql
Copy
Edit
ERROR:  duplicate key value violates unique constraint "customers_email_key"
4 CHECK Constraint Violation
Consequence: If a value does not satisfy the CHECK condition, the operation fails.
Example:
sql
Copy
Edit
CREATE TABLE products (
    product_id SERIAL PRIMARY KEY,
    price DECIMAL CHECK (price > 0)
);

INSERT INTO products (price) VALUES (-10); -- Negative price not allowed
Error Message:
sql
Copy
Edit
ERROR:  new row for relation "products" violates check constraint "products_price_check"
5 FOREIGN KEY Constraint Violation
Consequence: A FOREIGN KEY ensures referential integrity. If you try to insert a value that does not exist in the referenced table, the operation is rejected.
Example:
sql
Copy
Edit
CREATE TABLE departments (
    dept_id SERIAL PRIMARY KEY,
    dept_name TEXT
);

CREATE TABLE employees (
    emp_id SERIAL PRIMARY KEY,
    dept_id INT REFERENCES departments(dept_id)
);

INSERT INTO employees (dept_id) VALUES (99); -- No dept_id = 99 exists
Error Message:
pgsql
Copy
Edit
ERROR:  insert or update on table "employees" violates foreign key constraint "employees_dept_id_fkey"
6 DELETE Violating a FOREIGN KEY
Consequence: If a FOREIGN KEY references a row, deleting the parent row without cascading or handling dependencies will fail.
Example:
sql
Copy
Edit
DELETE FROM departments WHERE dept_id = 1;
Error Message:
pgsql
Copy
Edit
ERROR:  update or delete on table "departments" violates foreign key constraint "employees_dept_id_fkey" on table "employees"

6. You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00
Ans.Modifying the products Table to Add Constraints
Since the products table was created without constraints, we can use the ALTER TABLE command to add them.

1 Adding a PRIMARY KEY to product_id
Syntax:

sql
Copy
Edit
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);
 This ensures that product_id is unique and cannot be NULL.

2 Setting a Default Value for price
Syntax:

sql
Copy
Edit
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;
 This ensures that if no price is specified in an INSERT statement, it defaults to 50.00.

Final SQL Code
sql
Copy
Edit
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;
Testing the Changes
 Inserting a Product Without a Price (Default Should Apply)
sql
Copy
Edit
INSERT INTO products (product_id, product_name) VALUES (1, 'Laptop');
 Checking the Data
sql
Copy
Edit
SELECT * FROM products;
Expected Output:

product_id	product_name	price
1	Laptop	50.00

7.
Ans Here is the SQL query to fetch the student_name and class_name for each student using an INNER JOIN:

sql
Copy
Edit
SELECT
    students.student_name,
    classes.class_name
FROM students
INNER JOIN classes ON students.class_id = classes.class_id;

8.
Ans Here is the SQL query to fetch all order_id, customer_name, and product_name, ensuring that all products are listed, even if they are not associated with an order:

sql
Select
    orders.order_id,
    customers.customer_name,
    products.product_name
FROM products
LEFT JOIN orders ON products.order_id = orders.order_id
LEFT JOIN customers ON orders.customer_id = customers.customer_id;

9.
Ans. Here is the SQL query to find the total sales amount for each product using an INNER JOIN and the SUM() function:

sql


    products.product_name,
    SUM(sales.amount) AS total_sales
FROM sales
INNER JOIN products ON sales.product_id = products.product_id
GROUP BY products.product_name;

10.
Ans. Here is the SQL query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables:

sql

SELECT
    orders.order_id,
    customers.customer_name,
    order_details.quantity
FROM orders
INNER JOIN customers ON orders.customer_id = customers.customer_id
INNER JOIN order_details ON orders.order_id = order_details.order_id;

SQL Commands

1. Identify the primary keys and foreign keys in the Maven Movies DB.
Primary Keys vs. Foreign Keys:
Primary Key (PK): Uniquely identifies a record in a table.
Foreign Key (FK): Refers to a Primary Key in another table to establish relationships.
Example of PKs and FKs in the Maven Movies DB:

2. List all details of actors
sql
Copy
Edit
SELECT * FROM actor;

3. List all customer information from DB
Ans.
sql

SELECT * FROM customer;

4. List different countries
Ans. sql

SELECT DISTINCT country FROM country;

5. Display all active customers
Ans. sql

SELECT * FROM customer WHERE active = 1;

6. List of all rental IDs for customer with ID 1
Ans. sql

SELECT rental_id FROM rental WHERE customer_id = 1;

7. Display all the films whose rental duration is greater than 5
Ans. sql

SELECT * FROM film WHERE rental_duration > 5;

8. List the total number of films whose replacement cost is greater than $15 and less than $20
Ans. NT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9. Display the count of unique first names of actors
Ans. sql

SELECT COUNT(DISTINCT first_name) AS unique_actor_names FROM actor;

10. Display the first 10 records from the customer table
Ans. sql

SELECT * FROM customer LIMIT 10;

11. Display the first 3 records from the customer table whose first name starts with ‘B’
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12. Display the names of the first 5 movies which are rated as ‘G’
Ans. sql

SELECT title FROM film
WHERE rating = 'G'
LIMIT 5;

13. Find all customers whose first name starts with "A"
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE 'A%';

14. Find all customers whose first name ends with "A"
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE '%A';

15. Display the list of first 4 cities which start and end with ‘A’
Ans. sql

SELECT city FROM city
WHERE city LIKE 'A%A'
LIMIT 4;

16. Find all customers whose first name has "NI" in any position
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE '%NI%';

17. Find all customers whose first name has "r" in the second position
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE '_r%';

18. Find all customers whose first name starts with "A" and is at least 5 characters in length
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE 'A%'
AND LENGTH(first_name) >= 5;

19. Find all customers whose first name starts with "A" and ends with "O"
Ans. sql

SELECT * FROM customer
WHERE first_name LIKE 'A%O';

20. Get the films with PG and PG-13 rating using IN operator
Ans. sql

SELECT * FROM film
WHERE rating IN ('PG', 'PG-13');

21. Get the films with length between 50 to 100 using BETWEEN operator
Ans. sql

SELECT * FROM film
WHERE length BETWEEN 50 AND 100;

22. Get the top 50 actors using LIMIT operator
Ans. sql

SELECT * FROM actor
LIMIT 50;

23. Get the distinct film IDs from the inventory table
Ans. sql

SELECT DISTINCT film_id FROM inventory;

FUnctions

1. Retrieve the total number of rentals made in the Sakila database
Ans. sql

SELECT COUNT(*) AS total_rentals
FROM rental;

2. Find the average rental duration (in days) of movies rented from the Sakila database
Ans. sql

SELECT AVG(rental_duration) AS avg_rental_duration
FROM film;

3. Display the first name and last name of customers in uppercase
Ans. sql

SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;

4. Extract the month from the rental date and display it alongside the rental ID
Ans. sql

SELECT rental_id,
       MONTH(rental_date) AS rental_month
FROM rental;

5. Retrieve the count of rentals for each customer (display customer ID and count of rentals)
Ans. sql

SELECT customer_id,
       COUNT(rental_id) AS rental_count
FROM rental
GROUP BY customer_id;

6. Find the total revenue generated by each store
Ans. sql

SELECT store_id,
       SUM(amount) AS total_revenue
FROM payment
JOIN customer ON payment.customer_id = customer.customer_id
JOIN store ON customer.store_id = store.store_id
GROUP BY store_id;

7. Determine the total number of rentals for each category of movies
Ans. sql

SELECT category.name AS category_name,
       COUNT(rental.rental_id) AS total_rentals
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
GROUP BY category.name;

8. Find the average rental rate of movies in each language
Ans. sql

SELECT language.name AS language_name,
       AVG(film.rental_rate) AS avg_rental_rate
FROM film
JOIN language ON film.language_id = language.language_id
GROUP BY language.name;

9. Display the title of the movie, customer’s first name, and last name who rented it
Ans. sql

SELECT film.title, customer.first_name, customer.last_name
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN customer ON rental.customer_id = customer.customer_id;

10. Retrieve the names of all actors who have appeared in the film "Gone with the Wind"
Ans. sql

SELECT actor.first_name, actor.last_name
FROM film
JOIN film_actor ON film.film_id = film_actor.film_id
JOIN actor ON film_actor.actor_id = actor.actor_id
WHERE film.title = 'Gone with the Wind';

11. Retrieve the customer names along with the total amount they've spent on rentals
Ans. sql

SELECT customer.first_name, customer.last_name, SUM(payment.amount) AS total_spent
FROM customer
JOIN payment ON customer.customer_id = payment.customer_id
GROUP BY customer.customer_id;

12. List the titles of movies rented by each customer in a particular city (e.g., 'London')
Ans. sql

SELECT film.title, customer.first_name, customer.last_name, city.city
FROM rental
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
WHERE city.city = 'London'
GROUP BY film.title, customer.first_name, customer.last_name, city.city;

13. Display the top 5 rented movies along with the number of times they've been rented
Ans.sql

SELECT film.title, COUNT(rental.rental_id) AS rental_count
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY film.film_id, film.title
ORDER BY rental_count DESC
LIMIT 5;

14. Determine customers who have rented movies from both stores (store ID 1 and store ID 2)
Ans. sql

SELECT customer.customer_id, customer.first_name, customer.last_name
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN customer ON rental.customer_id = customer.customer_id
WHERE inventory.store_id IN (1, 2)
GROUP BY customer.customer_id, customer.first_name, customer.last_name
HAVING COUNT(DISTINCT inventory.store_id) = 2;

Windows Function:

1. Rank the customers based on the total amount they've spent on rentals
Ans. sql

SELECT customer_id, first_name, last_name, SUM(amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(amount) DESC) AS spending_rank
FROM payment
JOIN customer USING (customer_id)
GROUP BY customer_id, first_name, last_name;

2. Calculate the cumulative revenue generated by each film over time
Ans. sql

SELECT f.film_id, f.title, p.payment_date, SUM(p.amount)
       OVER (PARTITION BY f.film_id ORDER BY p.payment_date) AS cumulative_revenue
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN payment p ON r.rental_id = p.rental_id;

3. Determine the average rental duration for each film, considering films with similar lengths
Ans. sql

SELECT film_id, title, length, AVG(rental_duration)
       OVER (PARTITION BY length) AS avg_rental_duration
FROM film;

4. Identify the top 3 films in each category based on their rental counts
Ans. sql

SELECT fc.category_id, c.name AS category_name, f.title,
       COUNT(r.rental_id) AS rental_count,
       RANK() OVER (PARTITION BY fc.category_id ORDER BY COUNT(r.rental_id) DESC) AS rank_per_category
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY fc.category_id, c.name, f.film_id, f.title;

5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers
Ans. sql

SELECT customer_id, first_name, last_name,
       COUNT(rental_id) AS total_rentals,
       COUNT(rental_id) - AVG(COUNT(rental_id)) OVER () AS rental_diff
FROM rental
JOIN customer USING (customer_id)
GROUP BY customer_id, first_name, last_name;

6. Find the monthly revenue trend for the entire rental store over time
Ans. sql

SELECT DATE_FORMAT(payment_date, '%Y-%m') AS month,
       SUM(amount) AS total_revenue,
       SUM(SUM(amount)) OVER (ORDER BY DATE_FORMAT(payment_date, '%Y-%m')) AS cumulative_revenue
FROM payment
GROUP BY month;

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers
Ans. sql

WITH CustomerSpending AS (
    SELECT customer_id, first_name, last_name, SUM(amount) AS total_spent,
           PERCENT_RANK() OVER (ORDER BY SUM(amount) DESC) AS spending_percentile
    FROM payment
    JOIN customer USING (customer_id)
    GROUP BY customer_id, first_name, last_name
)
SELECT customer_id, first_name, last_name, total_spent
FROM CustomerSpending
WHERE spending_percentile <= 0.20;

8. Calculate the running total of rentals per category, ordered by rental count
Ans. sql

SELECT c.name AS category_name, COUNT(r.rental_id) AS rental_count,
       SUM(COUNT(r.rental_id)) OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) AS running_total
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.category_id, c.name;

9. Find the films that have been rented less than the average rental count for their respective categories
Ans. sql

WITH CategoryAverage AS (
    SELECT fc.category_id, f.film_id, f.title, COUNT(r.rental_id) AS rental_count,
           AVG(COUNT(r.rental_id)) OVER (PARTITION BY fc.category_id) AS avg_rental_count
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN film_category fc ON f.film_id = fc.film_id
    GROUP BY fc.category_id, f.film_id, f.title
)
SELECT film_id, title, rental_count, avg_rental_count
FROM CategoryAverage
WHERE rental_count < avg_rental_count;

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month
Ans. sql

SELECT DATE_FORMAT(payment_date, '%Y-%m') AS month, SUM(amount) AS total_revenue
FROM payment
GROUP BY month
ORDER BY total_revenue DESC
LIMIT 5;